cmsis-svd/cmsis-svd-data/data/Atmel/ATSAMD20G16.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>PORT</name>
         <version>U22101.0.0</version>
         <description>Port Module</description>
         <baseAddress>0x41004400</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x100</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <cluster>
               <dim>2</dim>
               <dimIncrement>0x80</dimIncrement>
               <name>GROUP[%s]</name>
               <description/>
               <addressOffset>0x00</addressOffset>
               <register>
                  <name>DIR</name>
                  <description>Data Direction</description>
                  <addressOffset>0x0</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>DIR</name>
                        <description>Port Data Direction</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DIRCLR</name>
                  <description>Data Direction Clear</description>
                  <addressOffset>0x4</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>DIRCLR</name>
                        <description>Port Data Direction Clear</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DIRSET</name>
                  <description>Data Direction Set</description>
                  <addressOffset>0x8</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>DIRSET</name>
                        <description>Port Data Direction Set</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DIRTGL</name>
                  <description>Data Direction Toggle</description>
                  <addressOffset>0xC</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>DIRTGL</name>
                        <description>Port Data Direction Toggle</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>OUT</name>
                  <description>Data Output Value</description>
                  <addressOffset>0x10</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>OUT</name>
                        <description>Port Data Output Value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>OUTCLR</name>
                  <description>Data Output Value Clear</description>
                  <addressOffset>0x14</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>OUTCLR</name>
                        <description>Port Data Output Value Clear</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>OUTSET</name>
                  <description>Data Output Value Set</description>
                  <addressOffset>0x18</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>OUTSET</name>
                        <description>Port Data Output Value Set</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>OUTTGL</name>
                  <description>Data Output Value Toggle</description>
                  <addressOffset>0x1C</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>OUTTGL</name>
                        <description>Port Data Output Value Toggle</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>IN</name>
                  <description>Data Input Value</description>
                  <addressOffset>0x20</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>IN</name>
                        <description>Port Data Input Value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CTRL</name>
                  <description>Control</description>
                  <addressOffset>0x24</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>SAMPLING</name>
                        <description>Input Sampling Mode</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>WRCONFIG</name>
                  <description>Write Configuration</description>
                  <addressOffset>0x28</addressOffset>
                  <size>32</size>
                  <access>write-only</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>PINMASK</name>
                        <description>Pin Mask for Multiple Pin Configuration</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                     <field>
                        <name>PMUXEN</name>
                        <description>Peripheral Multiplexer Enable</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>INEN</name>
                        <description>Input Enable</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PULLEN</name>
                        <description>Pull Enable</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DRVSTR</name>
                        <description>Output Driver Strength Selection</description>
                        <bitOffset>22</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PMUX</name>
                        <description>Peripheral Multiplexing</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>WRPMUX</name>
                        <description>Write PMUX</description>
                        <bitOffset>28</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>WRPINCFG</name>
                        <description>Write PINCFG</description>
                        <bitOffset>30</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>HWSEL</name>
                        <description>Half-Word Select</description>
                        <bitOffset>31</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <dim>16</dim>
                  <dimIncrement>1</dimIncrement>
                  <name>PMUX[%s]</name>
                  <description>Peripheral Multiplexing n</description>
                  <addressOffset>0x30</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>PMUXE</name>
                        <description>Peripheral Multiplexing Even</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>4</bitWidth>
                        <enumeratedValues>
                           <name>PMUXESelect</name>
                           <enumeratedValue>
                              <name>A</name>
                              <description>Peripheral function A selected</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>B</name>
                              <description>Peripheral function B selected</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>C</name>
                              <description>Peripheral function C selected</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>D</name>
                              <description>Peripheral function D selected</description>
                              <value>0x3</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>E</name>
                              <description>Peripheral function E selected</description>
                              <value>0x4</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>F</name>
                              <description>Peripheral function F selected</description>
                              <value>0x5</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>G</name>
                              <description>Peripheral function G selected</description>
                              <value>0x6</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>H</name>
                              <description>Peripheral function H selected</description>
                              <value>0x7</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>PMUXO</name>
                        <description>Peripheral Multiplexing Odd</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>4</bitWidth>
                        <enumeratedValues>
                           <name>PMUXOSelect</name>
                           <enumeratedValue>
                              <name>A</name>
                              <description>Peripheral function A selected</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>B</name>
                              <description>Peripheral function B selected</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>C</name>
                              <description>Peripheral function C selected</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>D</name>
                              <description>Peripheral function D selected</description>
                              <value>0x3</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>E</name>
                              <description>Peripheral function E selected</description>
                              <value>0x4</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>F</name>
                              <description>Peripheral function F selected</description>
                              <value>0x5</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>G</name>
                              <description>Peripheral function G selected</description>
                              <value>0x6</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>H</name>
                              <description>Peripheral function H selected</description>
                              <value>0x7</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <dim>32</dim>
                  <dimIncrement>1</dimIncrement>
                  <name>PINCFG[%s]</name>
                  <description>Pin Configuration n</description>
                  <addressOffset>0x40</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>PMUXEN</name>
                        <description>Peripheral Multiplexer Enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>INEN</name>
                        <description>Input Enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PULLEN</name>
                        <description>Pull Enable</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DRVSTR</name>
                        <description>Output Driver Strength Selection</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
